zephyrproject-rtos/zephyr/include/dt-bindings/pinctrl/pinctrl_stm32.h
/*
 * Copyright (c) 2017 Bobby Noelte
 *
 * SPDX-License-Identifier: Apache-2.0
 */

/**
 * @file
 * @brief STM32 pinctrl device tree defines
 * @defgroup device_driver_pinctrl_stm32_dts STM32 pinctrl device tree defines
 * @ingroup device_driver_pinctrl_stm32
 *
 * Device tree defines for the STM32 PINCTRL device driver.
 *
 * @note Not to be used with the STM32 PINMUX and GPIO driver.
 * @{
 */

#ifndef _PINCTRL_STM32_DTS_H
#define _PINCTRL_STM32_DTS_H

#include <pinctrl_common.h>

/**
 * @brief numerical IDs for IO ports
 */

#define	PINCTRL_STM32_PORTA 0	/* IO port A */
#define	PINCTRL_STM32_PORTB 1	/* .. */
#define	PINCTRL_STM32_PORTC 2
#define	PINCTRL_STM32_PORTD 3
#define	PINCTRL_STM32_PORTE 4
#define	PINCTRL_STM32_PORTF 5
#define	PINCTRL_STM32_PORTG 6
#define	PINCTRL_STM32_PORTH 7	/* IO port H */

/**
 * @def PINCTRL_STM32_PIN
 * @brief helper macro to encode an IO port pin in a numerical format
 */
#define PINCTRL_STM32_PIN(_port, _pin) \
	(_port << 4 | _pin)

/**
 * @brief PINCTRL STM32 Pin Defines
 * @defgroup pinctrl_interface_stm32_pin_defs PINCTRL STM32 Pin Defines
 * @ingroup device_driver_pinctrl_stm32_dts
 * @{
 */

/**
 * @def PINCTRL_STM32_PINA0
 * @brief Pin A0
 */
#define PINCTRL_STM32_PINA0	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTA, 0)
#define PINCTRL_STM32_PINA1	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTA, 1)
#define PINCTRL_STM32_PINA2	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTA, 2)
#define PINCTRL_STM32_PINA3	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTA, 3)
#define PINCTRL_STM32_PINA4	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTA, 4)
#define PINCTRL_STM32_PINA5	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTA, 5)
#define PINCTRL_STM32_PINA6	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTA, 6)
#define PINCTRL_STM32_PINA7	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTA, 7)
#define PINCTRL_STM32_PINA8	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTA, 8)
#define PINCTRL_STM32_PINA9	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTA, 9)
#define PINCTRL_STM32_PINA10	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTA, 10)
#define PINCTRL_STM32_PINA11	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTA, 11)
#define PINCTRL_STM32_PINA12	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTA, 12)
#define PINCTRL_STM32_PINA13	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTA, 13)
#define PINCTRL_STM32_PINA14	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTA, 14)
#define PINCTRL_STM32_PINA15	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTA, 15)

#define PINCTRL_STM32_PINB0	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTB, 0)
#define PINCTRL_STM32_PINB1	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTB, 1)
#define PINCTRL_STM32_PINB2	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTB, 2)
#define PINCTRL_STM32_PINB3	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTB, 3)
#define PINCTRL_STM32_PINB4	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTB, 4)
#define PINCTRL_STM32_PINB5	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTB, 5)
#define PINCTRL_STM32_PINB6	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTB, 6)
#define PINCTRL_STM32_PINB7	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTB, 7)
#define PINCTRL_STM32_PINB8	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTB, 8)
#define PINCTRL_STM32_PINB9	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTB, 9)
#define PINCTRL_STM32_PINB10	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTB, 10)
#define PINCTRL_STM32_PINB11	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTB, 11)
#define PINCTRL_STM32_PINB12	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTB, 12)
#define PINCTRL_STM32_PINB13	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTB, 13)
#define PINCTRL_STM32_PINB14	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTB, 14)
#define PINCTRL_STM32_PINB15	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTB, 15)

#define PINCTRL_STM32_PINC0	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTC, 0)
#define PINCTRL_STM32_PINC1	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTC, 1)
#define PINCTRL_STM32_PINC2	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTC, 2)
#define PINCTRL_STM32_PINC3	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTC, 3)
#define PINCTRL_STM32_PINC4	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTC, 4)
#define PINCTRL_STM32_PINC5	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTC, 5)
#define PINCTRL_STM32_PINC6	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTC, 6)
#define PINCTRL_STM32_PINC7	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTC, 7)
#define PINCTRL_STM32_PINC8	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTC, 8)
#define PINCTRL_STM32_PINC9	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTC, 9)
#define PINCTRL_STM32_PINC10	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTC, 10)
#define PINCTRL_STM32_PINC11	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTC, 11)
#define PINCTRL_STM32_PINC12	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTC, 12)
#define PINCTRL_STM32_PINC13	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTC, 13)
#define PINCTRL_STM32_PINC14	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTC, 14)
#define PINCTRL_STM32_PINC15	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTC, 15)

#define PINCTRL_STM32_PIND0	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTD, 0)
#define PINCTRL_STM32_PIND1	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTD, 1)
#define PINCTRL_STM32_PIND2	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTD, 2)
#define PINCTRL_STM32_PIND3	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTD, 3)
#define PINCTRL_STM32_PIND4	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTD, 4)
#define PINCTRL_STM32_PIND5	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTD, 5)
#define PINCTRL_STM32_PIND6	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTD, 6)
#define PINCTRL_STM32_PIND7	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTD, 7)
#define PINCTRL_STM32_PIND8	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTD, 8)
#define PINCTRL_STM32_PIND9	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTD, 9)
#define PINCTRL_STM32_PIND10	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTD, 10)
#define PINCTRL_STM32_PIND11	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTD, 11)
#define PINCTRL_STM32_PIND12	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTD, 12)
#define PINCTRL_STM32_PIND13	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTD, 13)
#define PINCTRL_STM32_PIND14	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTD, 14)
#define PINCTRL_STM32_PIND15	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTD, 15)

#define PINCTRL_STM32_PINE0	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTE, 0)
#define PINCTRL_STM32_PINE1	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTE, 1)
#define PINCTRL_STM32_PINE2	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTE, 2)
#define PINCTRL_STM32_PINE3	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTE, 3)
#define PINCTRL_STM32_PINE4	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTE, 4)
#define PINCTRL_STM32_PINE5	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTE, 5)
#define PINCTRL_STM32_PINE6	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTE, 6)
#define PINCTRL_STM32_PINE7	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTE, 7)
#define PINCTRL_STM32_PINE8	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTE, 8)
#define PINCTRL_STM32_PINE9	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTE, 9)
#define PINCTRL_STM32_PINE10	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTE, 10)
#define PINCTRL_STM32_PINE11	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTE, 11)
#define PINCTRL_STM32_PINE12	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTE, 12)
#define PINCTRL_STM32_PINE13	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTE, 13)
#define PINCTRL_STM32_PINE14	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTE, 14)
#define PINCTRL_STM32_PINE15	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTE, 15)

#define PINCTRL_STM32_PINF0	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTF, 0)
#define PINCTRL_STM32_PINF1	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTF, 1)
#define PINCTRL_STM32_PINF2	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTF, 2)
#define PINCTRL_STM32_PINF3	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTF, 3)
#define PINCTRL_STM32_PINF4	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTF, 4)
#define PINCTRL_STM32_PINF5	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTF, 5)
#define PINCTRL_STM32_PINF6	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTF, 6)
#define PINCTRL_STM32_PINF7	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTF, 7)
#define PINCTRL_STM32_PINF8	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTF, 8)
#define PINCTRL_STM32_PINF9	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTF, 9)
#define PINCTRL_STM32_PINF10	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTF, 10)
#define PINCTRL_STM32_PINF11	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTF, 11)
#define PINCTRL_STM32_PINF12	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTF, 12)
#define PINCTRL_STM32_PINF13	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTF, 13)
#define PINCTRL_STM32_PINF14	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTF, 14)
#define PINCTRL_STM32_PINF15	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTF, 15)

#define PINCTRL_STM32_PING0	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTG, 0)
#define PINCTRL_STM32_PING1	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTG, 1)
#define PINCTRL_STM32_PING2	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTG, 2)
#define PINCTRL_STM32_PING3	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTG, 3)
#define PINCTRL_STM32_PING4	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTG, 4)
#define PINCTRL_STM32_PING5	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTG, 5)
#define PINCTRL_STM32_PING6	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTG, 6)
#define PINCTRL_STM32_PING7	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTG, 7)
#define PINCTRL_STM32_PING8	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTG, 8)
#define PINCTRL_STM32_PING9	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTG, 9)
#define PINCTRL_STM32_PING10	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTG, 10)
#define PINCTRL_STM32_PING11	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTG, 11)
#define PINCTRL_STM32_PING12	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTG, 12)
#define PINCTRL_STM32_PING13	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTG, 13)
#define PINCTRL_STM32_PING14	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTG, 14)
#define PINCTRL_STM32_PING15	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTG, 15)

#define PINCTRL_STM32_PINH0	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTH, 0)
#define PINCTRL_STM32_PINH1	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTH, 1)
#define PINCTRL_STM32_PINH2	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTH, 2)
#define PINCTRL_STM32_PINH3	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTH, 3)
#define PINCTRL_STM32_PINH4	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTH, 4)
#define PINCTRL_STM32_PINH5	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTH, 5)
#define PINCTRL_STM32_PINH6	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTH, 6)
#define PINCTRL_STM32_PINH7	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTH, 7)
#define PINCTRL_STM32_PINH8	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTH, 8)
#define PINCTRL_STM32_PINH9	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTH, 9)
#define PINCTRL_STM32_PINH10	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTH, 10)
#define PINCTRL_STM32_PINH11	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTH, 11)
#define PINCTRL_STM32_PINH12	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTH, 12)
#define PINCTRL_STM32_PINH13	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTH, 13)
#define PINCTRL_STM32_PINH14	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTH, 14)
#define PINCTRL_STM32_PINH15	PINCTRL_STM32_PIN(PINCTRL_STM32_PORTH, 15)

/** @} pinctrl_interface_stm32_pin_defs */

/**
 * @brief PINCTRL STM32 Group Defines
 * @defgroup pinctrl_interface_stm32_group_defs PINCTRL STM32 Group Definess
 * @ingroup device_driver_pinctrl_stm32_dts
 * @{
 */

/** Groups are currently not supported. */

/** @} pinctrl_interface_stm32_group_defs */

/**
 * @brief PINCTRL STM32 Function Defines
 * @defgroup pinctrl_interface_stm32_func_defs PINCTRL STM32 Function Defines
 * @ingroup device_driver_pinctrl_stm32_dts
 * @{
 */

/* Alternate Functions */
#define PINCTRL_STM32_FUNCTION_ALT_0	PINCTRL_FUNCTION_HARDWARE_0
#define PINCTRL_STM32_FUNCTION_ALT_1	PINCTRL_FUNCTION_HARDWARE_1
#define PINCTRL_STM32_FUNCTION_ALT_2	PINCTRL_FUNCTION_HARDWARE_2
#define PINCTRL_STM32_FUNCTION_ALT_3	PINCTRL_FUNCTION_HARDWARE_3
#define PINCTRL_STM32_FUNCTION_ALT_4	PINCTRL_FUNCTION_HARDWARE_4
#define PINCTRL_STM32_FUNCTION_ALT_5	PINCTRL_FUNCTION_HARDWARE_5
#define PINCTRL_STM32_FUNCTION_ALT_6	PINCTRL_FUNCTION_HARDWARE_6
#define PINCTRL_STM32_FUNCTION_ALT_7	PINCTRL_FUNCTION_HARDWARE_7
#define PINCTRL_STM32_FUNCTION_ALT_8	PINCTRL_FUNCTION_HARDWARE_8
#define PINCTRL_STM32_FUNCTION_ALT_9	PINCTRL_FUNCTION_HARDWARE_9
#define PINCTRL_STM32_FUNCTION_ALT_10	PINCTRL_FUNCTION_HARDWARE_10
#define PINCTRL_STM32_FUNCTION_ALT_11	PINCTRL_FUNCTION_HARDWARE_11
#define PINCTRL_STM32_FUNCTION_ALT_12	PINCTRL_FUNCTION_HARDWARE_12
#define PINCTRL_STM32_FUNCTION_ALT_13	PINCTRL_FUNCTION_HARDWARE_13
#define PINCTRL_STM32_FUNCTION_ALT_14	PINCTRL_FUNCTION_HARDWARE_14
#define PINCTRL_STM32_FUNCTION_ALT_15	PINCTRL_FUNCTION_HARDWARE_15

/* General Functions */
#define PINCTRL_STM32_FUNCTION_INPUT	PINCTRL_FUNCTION_HARDWARE_16
#define PINCTRL_STM32_FUNCTION_OUTPUT	PINCTRL_FUNCTION_HARDWARE_17
#define PINCTRL_STM32_FUNCTION_ANALOG	PINCTRL_FUNCTION_HARDWARE_18

/** @} pinctrl_interface_stm32_func_defs */

#endif /* _PINCTRL_STM32_DTS_H */

/** @} device_driver_pinctrl_stm32_dts */
